muhammedAbulnaser/TivaC-I2C/TM4C123GH6PM_I2C_PROG.c
/*
  Author : Mohamed Abd Elnaser & Mohamed Abd Elmotaal
  Release : V 1.0.0
  Type   : I2C communiction protocol Driver 
	                                           */

#include "TM4C123GH6PM.h"
#include "TM4C123GH6PM_I2C_INTERFACE.h"
#include <stdint.h>

/*****************************************************************
**********Describtion : initilization the i2c*********************
             Required : 1- i2c_module_num you want to use(0,1,2,3)
                       	2- I2C_MODE {MASTER,SLAVE}						
***************return : void *************************************/
void I2C_init(int8_t I2C_NUM ,uint8_t I2C_MODE)
{
	switch(I2C_NUM)
	{
		case 0:
      SYSCTL->RCGCI2C |= I2C0_CE;                /* enable clock to I2C */
      I2C0->MTPR = TPR;                    /*ex: I2C_CLK speed using here is 100 kHz @ 16 MHz  */
      I2C0->MCR = I2C_MODE;                /* The mode you want  MASTER or SLAVE   */
      break;		
		case 1:
      SYSCTL->RCGCI2C |= I2C1_CE;                /* enable clock to I2C */
      I2C1->MTPR = TPR;                    /*ex: I2C_CLK speed using here is 100 kHz @ 16 MHz  */
      I2C1->MCR = I2C_MODE;                 /* The mode you want  MASTER or SLAVE   */
		  break;
		case 2:
      SYSCTL->RCGCI2C |= I2C2_CE;                /* enable clock to I2C */
      I2C2->MTPR = TPR;                    /*ex: I2C_CLK speed using here is 100 kHz @ 16 MHz  */
      I2C2->MCR = I2C_MODE;                  /* The mode you want  MASTER or SLAVE   */
		  break;
		case 3:
      SYSCTL->RCGCI2C |= I2C3_CE;                /* enable clock to I2C */
      I2C3->MTPR = TPR;                    /*ex: I2C_CLK speed using here is 100 kHz @ 16 MHz  */
      I2C3->MCR = I2C_MODE;                 /* The mode you want  MASTER or SLAVE   */
      break;
	}
}	
/************************************************************
*****Describtion : making sure that i2c master is not busy
                 and  no error ,ack_add is recived 
                 and  ack_data (first address ) is recived 
        
        Required : i2c_module_num you want to use(0,1,2,3)

*******Return : 8_bit variable erorr if this a problem *******
                   or zero (0) if evrey thing is okay 
*************************************************************/
static int8_t I2C_wait_till_done(int8_t I2C_NUM)
{
	switch(I2C_NUM)
	{
		case 0:
      while( I2C0->MCS & 1);      /* wait until I2C master is not busy */
      return I2C0->MCS & 0xE;    /* return I2C error code */
		  break;
		
		case 1:
      while( I2C1->MCS & 1);      /* wait until I2C master is not busy */
      return I2C1->MCS & 0xE;    /* return I2C error code */
		  break;
		
		case 2:
      while( I2C2->MCS & 1);      /* wait until I2C master is not busy */
      return I2C2->MCS & 0xE;    /* return I2C error code */
		  break;
		
		case 3:
      while( I2C3->MCS & 1);      /* wait until I2C master is not busy */
      return I2C3->MCS & 0xE;    /* return I2C error code */
      break;
	}

}

/*******************************************************************
***********Describtion : Write one byte only ***********************

*******      Required  : 1-i2c_module_num you want to use(0,1,2,3)
                         2- slave address
                         3- memory addres location of the data you want
                         4- pointer to save the reading data 

***** byte write seq : S-(saddr+w)-ACK-maddr-ACK-data-ACK-P *********
         
** return : 8_bit variable erorr if this a problem ******************
            or zero (0) if evrey thing is okay
*********************************************************************/

uint8_t I2C_byteWrite(int8_t I2C_NUM ,int8_t slaveAddr, int8_t memAddr, uint8_t data)
{
uint8_t error;
	switch(I2C_NUM)
	{
		case 0:
        /* send slave address and starting address to their regestiers  */
        I2C0->MSA = slaveAddr << 1;
        I2C0->MDR = memAddr;
	
        /*starting writing seq whic is  
	        S-(saddr+w)-ACK-maddr-ACK */
        I2C0->MCS = 3; 
        error = I2C_wait_till_done(0);        /* wait until write is complete */
        if (error) return error;
	
        /* sending data and waiting for ack and then sending stop */
        I2C0->MDR = data;                     /* loading data  in data reg*/
        I2C0->MCS = 5;                        /* -data-ACK-P */
        /*error = I2C_wait_till_done(0);*/    /*this line not working (checking ack_address)      /* wait until write is complete */
        while(I2C0->MCS & 0x40);              /* wait until bus is not busy */
        error = I2C0->MCS & 0xA;              /*checking that there are no error and ack_data is recived */ 
       if (error) return error;               /* if error is detected the func will return the err */
       return 0;                              /* no error */
		   break;
		
		case 1:
        /* send slave address and starting address to their regestiers  */
        I2C1->MSA = slaveAddr << 1;
        I2C1->MDR = memAddr;
	
        /*starting writing seq whic is  
	        S-(saddr+w)-ACK-maddr-ACK */
        I2C1->MCS = 3; 
        error = I2C_wait_till_done(1);        /* wait until write is complete */
        if (error) return error;
	
        /* sending data and waiting for ack and then sending stop */
        I2C1->MDR = data;                     /* loading data  in data reg*/
        I2C1->MCS = 5;                        /* -data-ACK-P */
        /*error = I2C_wait_till_done(1);*/    /*this line not working (checking ack_address)      /* wait until write is complete */
        while(I2C1->MCS & 0x40);              /* wait until bus is not busy */
        error = I2C1->MCS & 0xA;              /*checking that there are no error and ack_data is recived */ 
       if (error) return error;               /* if error is detected the func will return the err */
       return 0;                              /* no error */
		   break;
		
