muhammedAbulnaser/TivaC-I2C/TM4C123GH6PM_I2C_PROG.c
		case 2:
        /* send slave address and starting address to their regestiers  */
        I2C2->MSA = slaveAddr << 1;
        I2C2->MDR = memAddr;
	
        /*starting writing seq whic is  
	        S-(saddr+w)-ACK-maddr-ACK */
        I2C2->MCS = 3; 
        error = I2C_wait_till_done(2);        /* wait until write is complete */
        if (error) return error;
	
        /* sending data and waiting for ack and then sending stop */
        I2C2->MDR = data;                     /* loading data  in data reg*/
        I2C2->MCS = 5;                        /* -data-ACK-P */
        /*error = I2C_wait_till_done(2);*/    /*this line not working (checking ack_address)      /* wait until write is complete */
        while(I2C2->MCS & 0x40);              /* wait until bus is not busy */
        error = I2C2->MCS & 0xA;              /*checking that there are no error and ack_data is recived */ 
       if (error) return error;               /* if error is detected the func will return the err */
       return 0;                              /* no error */
		   break;
		
		case 3:
        /* send slave address and starting address to their regestiers  */
        I2C3->MSA = slaveAddr << 1;
        I2C3->MDR = memAddr;
	
        /*starting writing seq whic is  
	        S-(saddr+w)-ACK-maddr-ACK */
        I2C3->MCS = 3; 
        error = I2C_wait_till_done(3);        /* wait until write is complete */
        if (error) return error;
	
        /* sending data and waiting for ack and then sending stop */
        I2C3->MDR = data;                     /* loading data  in data reg*/
        I2C3->MCS = 5;                        /* -data-ACK-P */
        /*error = I2C_wait_till_done(0);*/    /*this line not working (checking ack_address)      /* wait until write is complete */
        while(I2C3->MCS & 0x40);              /* wait until bus is not busy */
        error = I2C3->MCS & 0xA;              /*checking that there are no error and ack_data is recived */ 
       if (error) return error;               /* if error is detected the func will return the err */
       return 0;                              /* no error */
		   break;    
	}
}

/*****************************************************************
***********Describtion : Read one byte only **********************

*******      Required  : 1-i2c_module_num you want to use(0,1,2,3)
                         2- slave address
                         3- memory addres location of the data you want
                         4- pointer to save the reading data 

***** byte write seq : S-(saddr+w)-ACK-maddr-ACK-
                       R-(saddr+r)-ACK-data-NACK-P
         
** return : 8_bit variable erorr if this a problem ***************
            or zero (0) if evrey thing is okay
******************************************************************/

uint8_t I2C_byteread(int8_t I2C_NUM ,int8_t slaveAddr, int8_t memAddr, uint8_t* data)
{
uint8_t error;
	
	switch(I2C_NUM)
	{
		case 0:
       /* send slave address and starting address */
       I2C0->MSA = slaveAddr << 1;
       I2C0->MDR = memAddr;
       I2C0->MCS = 3;                              /* S-(saddr+w)-ACK-maddr-ACK so we will send start and run */
       error = I2C_wait_till_done(0);
       if (error) return error;

       /* to change bus from write to read, send restart with slave addr */
       I2C0->MSA = (slaveAddr << 1) + 1;           /* restart: -R-(saddr+r)-ACK */
       I2C0->MCS = 7;                             /* -data-NACK-P so we will send repeated start and run and  stop  */

       error = I2C_wait_till_done(0);
       if (error) return error;

       *data = I2C0->MDR;                         /* store data received */

       while(I2C0->MCS & 0x40);                   /* wait until bus is not busy */
       return 0;                                  /* no error */
		   break;
		
		case 1:
       /* send slave address and starting address */
       I2C1->MSA = slaveAddr << 1;
       I2C1->MDR = memAddr;
       I2C1->MCS = 3;                              /* S-(saddr+w)-ACK-maddr-ACK so we will send start and run */
       error = I2C_wait_till_done(1);
       if (error) return error;

       /* to change bus from write to read, send restart with slave addr */
       I2C1->MSA = (slaveAddr << 1) + 1;           /* restart: -R-(saddr+r)-ACK */
       I2C1->MCS = 7;                             /* -data-NACK-P so we will send repeated start and run and  stop  */

       error = I2C_wait_till_done(1);
       if (error) return error;

       *data = I2C1->MDR;                         /* store data received */

       while(I2C1->MCS & 0x40);                   /* wait until bus is not busy */
       return 0;                                  /* no error */
		   break;
		
		case 2:
       /* send slave address and starting address */
       I2C2->MSA = slaveAddr << 1;
       I2C2->MDR = memAddr;
       I2C2->MCS = 3;                              /* S-(saddr+w)-ACK-maddr-ACK so we will send start and run */
       error = I2C_wait_till_done(2);
       if (error) return error;

       /* to change bus from write to read, send restart with slave addr */
       I2C2->MSA = (slaveAddr << 1) + 1;           /* restart: -R-(saddr+r)-ACK */
       I2C2->MCS = 7;                             /* -data-NACK-P so we will send repeated start and run and  stop  */

       error = I2C_wait_till_done(2);
       if (error) return error;

       *data = I2C2->MDR;                         /* store data received */

       while(I2C2->MCS & 0x40);                   /* wait until bus is not busy */
       return 0;                                  /* no error */
		   break;
		
		case 3:
       /* send slave address and starting address */
       I2C3->MSA = slaveAddr << 1;
       I2C3->MDR = memAddr;
       I2C3->MCS = 3;                              /* S-(saddr+w)-ACK-maddr-ACK so we will send start and run */
       error = I2C_wait_till_done(3);
       if (error) return error;

       /* to change bus from write to read, send restart with slave addr */
       I2C3->MSA = (slaveAddr << 1) + 1;           /* restart: -R-(saddr+r)-ACK */
       I2C3->MCS = 7;                             /* -data-NACK-P so we will send repeated start and run and  stop  */

       error = I2C_wait_till_done(3);
       if (error) return error;

       *data = I2C3->MDR;                         /* store data received */

       while(I2C3->MCS & 0x40);                   /* wait until bus is not busy */
       return 0;                                  /* no error */
		   break;

