muhammedAbulnaser/TivaC-I2C/TM4C123GH6PM_I2C_PROG.c
	}
}	

/*******************************************************************
***********Describtion : Write n bytes of data ***********************

*******      Required  : 1-i2c_module_num you want to use(0,1,2,3)
                         2- slave address
                         3-  first memory addres location of the data 
                         4- pointer to the memory location to the data 

***** byte write seq : S-(saddr+w)-ACK-maddr-ACK-data-ACK-P *********
         
** return : 8_bit variable erorr if this a problem ******************
            or zero (0) if evrey thing is okay
*********************************************************************/

uint8_t I2C_burstWrite(int8_t I2C_NUM,int8_t slaveAddr, int8_t memAddr, int8_t byteCount, uint8_t* data)
{
	uint8_t error;
	
if (byteCount <= 0)
return -1;                                /* no write was performed */

switch(I2C_NUM)
{
	case 0:
      /* send slave address and starting address */
      I2C0->MSA = slaveAddr << 1;
      I2C0->MDR = memAddr;
      I2C0->MCS = 3;                          /* S-(saddr+w)-ACK-maddr-ACK */
      error = I2C_wait_till_done(0);          /* wait until write is complete */
      if (error) return error;

      /* send data one byte at a time */
      while (byteCount > 1)
       {
        I2C0->MDR = *data++;                     /* write the next byte */
        I2C0->MCS = 1;                           /* -data-ACK- */
        error = I2C_wait_till_done(0);      /* i have a comment in this line */
        if (error) return error;
        byteCount--;
       }

      /* send last byte and a STOP */
      I2C0->MDR = *data++;                    /* write the last byte */
      I2C0->MCS = 5;                         /* -data-ACK-P */
      error = I2C_wait_till_done(0);
      while(I2C0->MCS & 0x40);              /* wait until bus is not busy */
      if (error) return error;
      return 0;                            /* no error */
	    break;
			 
	case 1:
      /* send slave address and starting address */
      I2C1->MSA = slaveAddr << 1;
      I2C1->MDR = memAddr;
      I2C1->MCS = 3;                          /* S-(saddr+w)-ACK-maddr-ACK */
      error = I2C_wait_till_done(1);          /* wait until write is complete */
      if (error) return error;

      /* send data one byte at a time */
      while (byteCount > 1)
       {
        I2C1->MDR = *data++;                     /* write the next byte */
        I2C1->MCS = 1;                           /* -data-ACK- */
        error = I2C_wait_till_done(1);      /* i have a comment in this line */
        if (error) return error;
        byteCount--;
       }

      /* send last byte and a STOP */
      I2C1->MDR = *data++;                    /* write the last byte */
      I2C1->MCS = 5;                         /* -data-ACK-P */
      error = I2C_wait_till_done(1);
      while(I2C1->MCS & 0x40);              /* wait until bus is not busy */
      if (error) return error;
      return 0;                            /* no error */
		  break; 
			 
	case 2:
      /* send slave address and starting address */
      I2C2->MSA = slaveAddr << 1;
      I2C2->MDR = memAddr;
      I2C2->MCS = 3;                          /* S-(saddr+w)-ACK-maddr-ACK */
      error = I2C_wait_till_done(2);          /* wait until write is complete */
      if (error) return error;

      /* send data one byte at a time */
      while (byteCount > 1)
       {
        I2C2->MDR = *data++;                     /* write the next byte */
        I2C2->MCS = 1;                           /* -data-ACK- */
        error = I2C_wait_till_done(2);      /* i have a comment in this line */
        if (error) return error;
        byteCount--;
       }

      /* send last byte and a STOP */
      I2C2->MDR = *data++;                    /* write the last byte */
      I2C2->MCS = 5;                         /* -data-ACK-P */
      error = I2C_wait_till_done(2);
      while(I2C2->MCS & 0x40);              /* wait until bus is not busy */
      if (error) return error;
      return 0;                            /* no error */
		  break; 		

  case 3:
      /* send slave address and starting address */
      I2C3->MSA = slaveAddr << 1;
      I2C3->MDR = memAddr;
      I2C3->MCS = 3;                          /* S-(saddr+w)-ACK-maddr-ACK */
      error = I2C_wait_till_done(3);          /* wait until write is complete */
      if (error) return error;

      /* send data one byte at a time */
      while (byteCount > 1)
       {
        I2C3->MDR = *data++;                     /* write the next byte */
        I2C3->MCS = 1;                           /* -data-ACK- */
        error = I2C_wait_till_done(3);      /* i have a comment in this line */
        if (error) return error;
        byteCount--;
       }

      /* send last byte and a STOP */
      I2C3->MDR = *data++;                    /* write the last byte */
      I2C3->MCS = 5;                         /* -data-ACK-P */
      error = I2C_wait_till_done(3);
      while(I2C3->MCS & 0x40);              /* wait until bus is not busy */
      if (error) return error;
      return 0;                            /* no error */
		  break; 			 
    }
}

/*****************************************************************
***********Describtion : Read n bytes of data**********************

*******      Required  : 1- i2c_module_num you want to use(0,1,2,3)
                         2- slave address
                         3- first memory addres location of the data you want
                         4- pointer to save the reading data 

***** byte write seq : S-(saddr+w)-ACK-maddr-ACK-
                       R-(saddr+r)-ACK-data-NACK-P
         
** return : 8_bit variable erorr if this a problem ***************
            or zero (0) if evrey thing is okay
******************************************************************/

uint8_t I2C_burstread(int8_t I2C_NUM,int8_t slaveAddr, int8_t memAddr, int8_t byteCount, uint8_t* data)

{
	
	uint8_t error;
	
