muhammedAbulnaser/TivaC-I2C/TM4C123GH6PM_I2C_PROG.c
if (byteCount <= 0)
return -1; /* no read was performed */

switch(I2C_NUM)
{
	
 case 0 :
       /* send slave address and starting address */
       I2C0->MSA = slaveAddr << 1;
       I2C0->MDR = memAddr;
       I2C0->MCS = 3;                               /* S-(saddr+w)-ACK-maddr-ACK */

	     error = I2C_wait_till_done(0);
       if (error) return error;
	
       /* to change bus from write to read, send restart with slave addr */
       I2C0->MSA = (slaveAddr << 1) + 1;              /* restart: -R-(saddr+r)-ACK */
       if (byteCount == 1)                           /* if last byte, don't ack */
       I2C0->MCS = 7;                               /* -data-NACK-P */
       else                                        /* else ack */
       I2C0->MCS = 0xB;                           /* -data-ACK- */

       error = I2C_wait_till_done(0);
       if (error) return error;
			 
       *data++ = I2C0->MDR;                       /* store the data received */
       if (--byteCount == 0)                     /* if single byte read, done */
        {
         while(I2C0->MCS & 0x40);               /* wait until bus is not busy */
         return 0;                             /* no error */
        }
				
       /* read the rest of the bytes */
       while (byteCount > 1)
        {
         I2C0->MCS = 9;                        /* -data-ACK- */
         error = I2C_wait_till_done(0);
         if (error) return error;
         byteCount--;
         *data++ = I2C0->MDR;                /* store data received */
        }
				
       I2C0->MCS = 5;                        /* -data-NACK-P */
       error = I2C_wait_till_done(1);
       *data = I2C0->MDR;                   /* store data received */
       while(I2C0->MCS & 0x40);             /* wait until bus is not busy */
       return 0;                           /* no error */
	     break;
				
 case 1 :
       /* send slave address and starting address */
       I2C1->MSA = slaveAddr << 1;
       I2C1->MDR = memAddr;
       I2C1->MCS = 3;                               /* S-(saddr+w)-ACK-maddr-ACK */

	     error = I2C_wait_till_done(1);
       if (error) return error;
	
       /* to change bus from write to read, send restart with slave addr */
       I2C1->MSA = (slaveAddr << 1) + 1;              /* restart: -R-(saddr+r)-ACK */
       if (byteCount == 1)                           /* if last byte, don't ack */
       I2C1->MCS = 7;                               /* -data-NACK-P */
       else                                        /* else ack */
       I2C1->MCS = 0xB;                           /* -data-ACK- */

       error = I2C_wait_till_done(1);
       if (error) return error;
			 
       *data++ = I2C1->MDR;                       /* store the data received */
       if (--byteCount == 0)                     /* if single byte read, done */
        {
         while(I2C1->MCS & 0x40);               /* wait until bus is not busy */
         return 0;                             /* no error */
        }
				
       /* read the rest of the bytes */
       while (byteCount > 1)
        {
         I2C1->MCS = 9;                        /* -data-ACK- */
         error = I2C_wait_till_done(1);
         if (error) return error;
         byteCount--;
         *data++ = I2C1->MDR;                /* store data received */
        }
				
       I2C1->MCS = 5;                        /* -data-NACK-P */
       error = I2C_wait_till_done(1);
       *data = I2C1->MDR;                   /* store data received */
       while(I2C1->MCS & 0x40);             /* wait until bus is not busy */
       return 0;                           /* no error */
       break;
				
	case 2 :
       /* send slave address and starting address */
       I2C2->MSA = slaveAddr << 1;
       I2C2->MDR = memAddr;
       I2C2->MCS = 3;                               /* S-(saddr+w)-ACK-maddr-ACK */

	     error = I2C_wait_till_done(2);
       if (error) return error;
	
       /* to change bus from write to read, send restart with slave addr */
       I2C2->MSA = (slaveAddr << 1) + 1;              /* restart: -R-(saddr+r)-ACK */
       if (byteCount == 1)                           /* if last byte, don't ack */
       I2C2->MCS = 7;                               /* -data-NACK-P */
       else                                        /* else ack */
       I2C2->MCS = 0xB;                           /* -data-ACK- */

       error = I2C_wait_till_done(2);
       if (error) return error;
			 
       *data++ = I2C2->MDR;                       /* store the data received */
       if (--byteCount == 0)                     /* if single byte read, done */
        {
         while(I2C2->MCS & 0x40);               /* wait until bus is not busy */
         return 0;                             /* no error */
        }
				
       /* read the rest of the bytes */
       while (byteCount > 1)
        {
         I2C2->MCS = 9;                        /* -data-ACK- */
         error = I2C_wait_till_done(2);
         if (error) return error;
         byteCount--;
         *data++ = I2C2->MDR;                /* store data received */
        }
				
       I2C2->MCS = 5;                        /* -data-NACK-P */
       error = I2C_wait_till_done(2);
       *data = I2C2->MDR;                   /* store data received */
       while(I2C2->MCS & 0x40);             /* wait until bus is not busy */
       return 0;                           /* no error */
				break;
				
	case 3 :
       /* send slave address and starting address */
       I2C3->MSA = slaveAddr << 1;
       I2C3->MDR = memAddr;
       I2C3->MCS = 3;                               /* S-(saddr+w)-ACK-maddr-ACK */

	     error = I2C_wait_till_done(3);
       if (error) return error;
	
       /* to change bus from write to read, send restart with slave addr */
       I2C3->MSA = (slaveAddr << 1) + 1;              /* restart: -R-(saddr+r)-ACK */
       if (byteCount == 1)                           /* if last byte, don't ack */
       I2C3->MCS = 7;                               /* -data-NACK-P */
       else                                        /* else ack */
       I2C3->MCS = 0xB;                           /* -data-ACK- */

       error = I2C_wait_till_done(3);
       if (error) return error;
			 
       *data++ = I2C3->MDR;                       /* store the data received */
       if (--byteCount == 0)                     /* if single byte read, done */
        {
         while(I2C3->MCS & 0x40);               /* wait until bus is not busy */
         return 0;                             /* no error */
        }
				
       /* read the rest of the bytes */
       while (byteCount > 1)
        {
         I2C3->MCS = 9;                        /* -data-ACK- */
         error = I2C_wait_till_done(3);
         if (error) return error;
         byteCount--;
         *data++ = I2C3->MDR;                /* store data received */
        }
				
       I2C3->MCS = 5;                        /* -data-NACK-P */
       error = I2C_wait_till_done(3);
       *data = I2C3->MDR;                   /* store data received */
       while(I2C3->MCS & 0x40);             /* wait until bus is not busy */
       return 0;                           /* no error */
				break;
  }
}